{"about":"PLD is a home design and construction company serving Chicago's premier housing markets. Our clients come to us with ideas about building a house that conforms to their lifestyle. We offer full service in the design and construction of custom-crafted luxury and single-family homes.\r\n<br /><br />\r\nInspiration comes in many forms, when you aspire to create the home that perfectly suits you. Every detail must be considered. Our design flow is to record your ideas, process and organize them, and return them to you for refinement. That is iteration. When a design is ready, we make all of the arrangement. That is preparation. \r\n<br /><br />\r\nPLD specializes in complete construction of unique homes and residential renovations. Our services begin pre-build: research and site acquisition, architecture, zoning and permits. We are your complete construction managers. We coordinate and oversee every step of the build thru post-completion.\r\n<br /><br />\r\nCollaboration is the strategy. Coordination and Organization are the methods. We are dedicated to the idea that building a home should be a wholly positive and exciting experience. ","services":{"design":"Style. Simplicity. Elegance. These are the qualities that define our homes. They contribute to the elements of peace and comfort we all seek where we live.\r\n<br /><br />\r\nDesigning your own home is a most rewarding endeavor.Our work is to guide you in finding all the possibility and potential of your home.\r\n<br /><br />\r\nOur goal during the design phase if to facilitate explorations in styles, locations, materials, and includes visits to galleries, showrooms, and existing homes. We also look at global styles, and seek inspiration from emerging trends in architecture and home design. \r\n<br /><br />\r\n","build":"Structures. They hold us together. They define the space within. They are the very frame of our existence. \r\n<br /><br />\r\nBuilding is a collaboration. At PLD, we bring together the many hands that move a design into production, and a production into a finished product. \r\n<br /><br />\r\nIndustry Standards do not apply to our work. There is no industrial home. Our standards must exceed your own, in all elements of the build. We call that craftsmanship. \r\n<br /><br />\r\nWe take designs through complete formation, from the bureaucratic to the pragmatic: drafts, permits, materials handling, and contracting. We are familiar with the practical matters of undertaking a custom construction. Development strategies are the core of our business.\r\n<br /><br />\r\nYou'll work with us directly to craft a vision for you home. We, in turn, will then analyze it with regard to the conditions of the environment and market. We are realistic about expectations and forthright about budgets.\r\n<br /><br />\r\nConstruction proceeds along well a ordered time-line, because we analyze and prepare for every step. Our building managers maintain precise control over build schedules. By staying organized ahead of the schedule, there are no surprises. \r\n<br /><br />\r\nThe project is not complete until all elements have received their \r\nfinishing touches, and have been fully appraised, down to every door-hinge. Quality is uniform. Post-construction is as much a part of the project as all other steps. We ensure our works lives up to every promise. "},"contact":{"street":"935 W. Chestnut Street","suite":"Suite 410","city":"Chicago, Illinois 60642","phone":"312-719-9991","fax":"312-267-2284","email":"info@pldhomes.com"},"contact.street":"Street Address","contact.suite":"Suite","contact.city":"City, State ZIP","contact.phone":"Phone","contact.fax":"Fax","contact.email":"e-mail","services.design":"lestie, nisl eros interdum leo, non elementum tellus nulla sed diam. Nam at erat urna, nec laoreet tortor. Praesent est erat, lacinia eget dignissim eu, molestie vitae sapien. Donec in diam quis nisi fringilla gravida. Pellentesque erat arcu, dapibus ut malesuada id, cursus eu augue. Nulla facilisi. Quisque tincidunt lectus a odio commodo pretium. Ut a odio quis velit imperdiet pretium. Proin velit magna, varius et convallis vel, consectetur scelerisque nisl. Donec non ligula turpis, a ultrices leo. Quisque eget varius diam. Phasellus lectus eros, imperdiet sed adipiscing ut, iaculis quis magna. Praesent vel arcu eros, ut fermentum quam. Donec ac nibh porta est luctus tincidunt. Cras tristique ipsum sem. In quis nisi posuere diam vehicula lacinia. Etiam imperdiet enim quis velit molestie a pulvinar turpis commodo. Nulla facilisi. Aenean in augue et nulla tincidunt porttitor nec non urna. Quisque ut purus purus. Nulla facilisi. Donec porta felis a sapien porttitor ac luctus mauris adipiscing. Sed vitae dolor metus, eu ullamcorper odio. Phasellus odio sem, mattis ac facilisis in, egestas vel lectus. Sed eget neque dolor, nec condimentum turpis. Duis tincidunt ullamcorper eros in tincidunt. Curabitur at nibh a arcu viverra consectetur sit amet eu arcu. Ut imperdiet volutpat vestibulum. Aenean condimentum arcu at orci egestas sit amet lobortis tellus blandit. Class aptent taci","services.build":"lestie, nisl eros interdum leo, non elementum tellus nulla sed diam. Nam at erat urna, nec laoreet tortor. Praesent est erat, lacinia eget dignissim eu, molestie vitae sapien. Donec in diam quis nisi fringilla gravida. Pellentesque erat arcu, dapibus ut malesuada id, cursus eu augue. Nulla facilisi. Quisque tincidunt lectus a odio commodo pretium. Ut a odio quis velit imperdiet pretium. Proin velit magna, varius et convallis vel, consectetur scelerisque nisl. Donec non ligula turpis, a ultrices leo. Quisque eget varius diam. Phasellus lectus eros, imperdiet sed adipiscing ut, iaculis quis magna. Praesent vel arcu eros, ut fermentum quam. Donec ac nibh porta est luctus tincidunt. Cras tristique ipsum sem. In quis nisi posuere diam vehicula lacinia. Etiam imperdiet enim quis velit molestie a pulvinar turpis commodo. Nulla facilisi. Aenean in augue et nulla tincidunt porttitor nec non urna. Quisque ut purus purus. Nulla facilisi. Donec porta felis a sapien porttitor ac luctus mauris adipiscing. Sed vitae dolor metus, eu ullamcorper odio. Phasellus odio sem, mattis ac facilisis in, egestas vel lectus. Sed eget neque dolor, nec condimentum turpis. Duis tincidunt ullamcorper eros in tincidunt. Curabitur at nibh a arcu viverra consectetur sit amet eu arcu. Ut imperdiet volutpat vestibulum. Aenean condimentum arcu at orci egestas sit amet lobortis tellus blandit. Class aptent taci"}