[{"img":{"large":"images/large_interiorSelect_119.JPG","thumb":"images/thumb_interiorSelect_119.jpg","medium":"images/medium_interiorSelect_119.jpg"},"address":"1022 West Altgeld, Chicago Illinois 60614","description":"It all begins with a great plan. From the very first look, this home exudes elegance. The limestone and brick facade with well appointed mansard copper roof, reminisce of classic French Manor.\r\nThe oversized mahogany door opens to a gracious Entryway with immediate view of a dramatic staircase, complemented by hand milled newel.\r\nThis 5,500 square foot home, designed by Stoneberg+Gross Architects offers an expensive floorpan with well proportioned rooms and includes formal Living and Dining Rooms, Christopher Peacock inspired kitchen with built-in Eating Area, Family Room with limestone fireplace and custom built-in; three bedrooms and two bathrooms on the second level, including a spa quality bathroom; Penthouse level comprised of two generous rooms and a very private roof deck as well as full bathroom; lower level includes separate areas for adult and youth entertainment, a true sauna with a cold splash and full bathroom.This home is built with several building exceptions; breezeway attached 2,5 car garage is just one of them. Additional features include hardwood floors throughout all three levels; intricate millwork detailing including coffered ceiling details and extensive built-ins; sophisticated natural stone bathroom appointments;three wood burning fireplaces with limestone mantels; multiple outdoor areas on Main and Penthouse levels;complete Home Automation set-up; Radiant heated floors and outdoor areas.\r\n\r\n\r\n\r\n","status":"SOLD","_id":"0"},{"img":{"large":"images/large_greenview-37.jpg","thumb":"images/thumb_greenview-37.jpg","medium":"images/medium_greenview-37.jpg"},"address":"3618 North Greenview Avenue Chicago Illinois 60613","description":"  \r\n\r\nYou don't come  across homes like this often. Classically elegant, well proportioned and meticulusly considered to the smallest detail - this home features something extremely rare- unparalleled luxury and quality in every regard.\r\nSituated on an extra wide - 37 foot lot of Lakeview's most prestigious - Southport Corridor area, this masterful two story, single family home offers the most versatile space that can support the most demanding and unique requirements.\r\nWide - open spaces, rooms for formal and informal entertaining,4-car attached garage, private outdoor spaces,premium eat-in kitchen and built-ins , incomparable master suite with foyer and two properly designed dressing rooms.This is luxury at it's best.\r\n\r\n","status":"SOLD","_id":"1"},{"img":{"large":"images/large_KENNETH.jpg","thumb":"images/thumb_KENNETH.jpg","medium":"images/medium_KENNETH.jpg"},"address":"5843 North Kenneth Chicago,Illinois 60646","description":"","status":"SOLD","_id":"2"},{"address":"1623 North Bell Street Chicago, Illinois 60647","description":"","status":"SOLD","_id":"3","img":{"large":"images/large_BELL FRONT.jpg","thumb":"images/thumb_BELL FRONT.jpg","medium":"images/medium_BELL FRONT.jpg"}},{"address":"1416 West Olive Avenue Chicago, Illinois 60660","description":"","status":"SOLD","_id":"4","img":{"large":"images/large_olive port.jpg","thumb":"images/thumb_olive port.jpg","medium":"images/medium_olive port.jpg"}},{"address":"3137 North Oakley Avenue Chicago, Illinois 60618","description":"","status":"AVAILABLE FOR SALE","_id":"5","img":{"large":"images/large_Oakley front.jpg","thumb":"images/thumb_Oakley front.jpg","medium":"images/medium_Oakley front.jpg"}},{"img":{"large":"images/large_WELLINGTON1111.jpg","thumb":"images/thumb_WELLINGTON1111.jpg","medium":"images/medium_WELLINGTON1111.jpg"},"address":"1536 West Wellington Avenue Chicago, illinois 60657","description":"","status":"SOLD","_id":"6"},{}]